nxp-mcuxpresso/mcux-soc-svd/MCXW716C/MCXW716C.xml
        <register>
          <name>MBC0_DERR_W1</name>
          <description>MBC Domain Error Word1 Register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDID</name>
              <description>Error domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EATR</name>
              <description>Error attributes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUI</name>
                  <description>Secure user mode, instruction fetch access.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUD</name>
                  <description>Secure user mode, data access.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>Secure privileged mode, instruction fetch access.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPD</name>
                  <description>Secure privileged mode, data access.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSUI</name>
                  <description>Nonsecure user mode, instruction fetch access.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSUD</name>
                  <description>Nonsecure user mode, data access.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSPI</name>
                  <description>Nonsecure privileged mode, instruction fetch access.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSPD</name>
                  <description>Nonsecure privileged mode, data access.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERW</name>
              <description>Error read/write</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read</name>
                  <description>Read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>write</name>
                  <description>Write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPORT</name>
              <description>Error port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0</name>
                  <description>mbcxslv0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1</name>
                  <description>mbcxslv1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S2</name>
                  <description>mbcxslv2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S3</name>
                  <description>mbcxslv3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EST</name>
              <description>Error state</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOVIO0</name>
                  <description>No access violation has been detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOVIO1</name>
                  <description>No access violation has been detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>A single access violation has been detected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI</name>
                  <description>Multiple access violations for this domain have been detected by this submodule instance. Only the address and attribute information for the first error have been captured in DERR_W0_i and DERR_W1_i.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC0_DERR_W3</name>
          <description>MBC Domain Error Word3 Register</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECR</name>
              <description>Rearm Error Capture Registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC1_DERR_W0</name>
          <description>MBC Domain Error Word0 Register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC1_DERR_W1</name>
          <description>MBC Domain Error Word1 Register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDID</name>
              <description>Error domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EATR</name>
              <description>Error attributes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUI</name>
                  <description>Secure user mode, instruction fetch access.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUD</name>
                  <description>Secure user mode, data access.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>Secure privileged mode, instruction fetch access.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPD</name>
                  <description>Secure privileged mode, data access.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSUI</name>
                  <description>Nonsecure user mode, instruction fetch access.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSUD</name>
                  <description>Nonsecure user mode, data access.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSPI</name>
                  <description>Nonsecure privileged mode, instruction fetch access.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSPD</name>
                  <description>Nonsecure privileged mode, data access.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERW</name>
              <description>Error read/write</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read</name>
                  <description>Read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>write</name>
                  <description>Write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPORT</name>
              <description>Error port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0</name>
                  <description>mbcxslv0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1</name>
                  <description>mbcxslv1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S2</name>
                  <description>mbcxslv2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S3</name>
                  <description>mbcxslv3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EST</name>
              <description>Error state</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOVIO0</name>
                  <description>No access violation has been detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOVIO1</name>
                  <description>No access violation has been detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>A single access violation has been detected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI</name>
                  <description>Multiple access violations for this domain have been detected by this submodule instance. Only the address and attribute information for the first error have been captured in DERR_W0_i and DERR_W1_i.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC1_DERR_W3</name>
          <description>MBC Domain Error Word3 Register</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECR</name>
              <description>Rearm Error Capture Registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC2_DERR_W0</name>
          <description>MBC Domain Error Word0 Register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC2_DERR_W1</name>
          <description>MBC Domain Error Word1 Register</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDID</name>
              <description>Error domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EATR</name>
              <description>Error attributes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUI</name>
                  <description>Secure user mode, instruction fetch access.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUD</name>
                  <description>Secure user mode, data access.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>Secure privileged mode, instruction fetch access.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPD</name>
                  <description>Secure privileged mode, data access.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSUI</name>
                  <description>Nonsecure user mode, instruction fetch access.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSUD</name>
                  <description>Nonsecure user mode, data access.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSPI</name>
                  <description>Nonsecure privileged mode, instruction fetch access.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSPD</name>
                  <description>Nonsecure privileged mode, data access.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERW</name>
              <description>Error read/write</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read</name>
                  <description>Read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>write</name>
                  <description>Write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPORT</name>
              <description>Error port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0</name>
                  <description>mbcxslv0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1</name>
                  <description>mbcxslv1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S2</name>
                  <description>mbcxslv2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S3</name>
                  <description>mbcxslv3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EST</name>
              <description>Error state</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOVIO0</name>
                  <description>No access violation has been detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOVIO1</name>
                  <description>No access violation has been detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>A single access violation has been detected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI</name>
                  <description>Multiple access violations for this domain have been detected by this submodule instance. Only the address and attribute information for the first error have been captured in DERR_W0_i and DERR_W1_i.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC2_DERR_W3</name>
          <description>MBC Domain Error Word3 Register</description>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECR</name>
              <description>Rearm Error Capture Registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MRC0_DERR_W0</name>
          <description>MRC Domain Error Word0 Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
