nxp-mcuxpresso/mcux-soc-svd/MCXW716C/MCXW716C.xml
        <register>
          <name>RF2p4GHz_WOR2</name>
          <description>2.4GHz WOR Register 2</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DURATION</name>
              <description>WOR Low Power Duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WOR_WKUP</name>
              <description>WOR Wakeup</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WOR_WKUP_0</name>
                  <description>WOR low power mode wakeup deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_WKUP_1</name>
                  <description>WOR low power mode wakeup asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WOR_EN</name>
              <description>WOR Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WOR_EN_0</name>
                  <description>WOR low power mode entry/wakeup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_EN_1</name>
                  <description>WOR low power mode entry/wakeup enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_MAN1</name>
          <description>2.4GHz MAN Register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENTER_TIME</name>
              <description>MAN Low Power Entry Time Stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENTER_REQ</name>
              <description>MAN Low Power Entry Request</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENTER_REQ_0</name>
                  <description>MAN low power mode request deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENTER_REQ_1</name>
                  <description>MAN low power mode request asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_MAN2</name>
          <description>2.4GHz MAN Register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUP_TIME</name>
              <description>MAN Low Power Wakeup Time Stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAN_WKUP</name>
              <description>MAN Wakeup</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAN_WKUP_0</name>
                  <description>MAN low power mode wakeup deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_WKUP_1</name>
                  <description>MAN low power mode wakeup asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN_EN</name>
              <description>MAN Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAN_EN_0</name>
                  <description>MAN low power mode entry/wakeup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_EN_1</name>
                  <description>MAN low power mode entry/wakeup enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_MAN3</name>
          <description>2.4GHz MAN Register 3</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENTER_TIME_CAPT</name>
              <description>MAN Low Power Entry Time Captured</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_MAN4</name>
          <description>2.4GHz MAN Register 4</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUP_TIME_CAPT</name>
              <description>MAN Low Power Wakeup Time Captured</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
