nxp-mcuxpresso/mcux-soc-svd/MCXW716C/MCXW716C.xml
        <register>
          <name>EDFR</name>
          <description>EFT Detect Flag</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>EDF0</name>
              <description>EFT Detect Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF1</name>
              <description>EFT Detect Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF2</name>
              <description>EFT Detect Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF3</name>
              <description>EFT Detect Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF4</name>
              <description>EFT Detect Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF5</name>
              <description>EFT Detect Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF6</name>
              <description>EFT Detect Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved7</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF8</name>
              <description>EFT Detect Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF9</name>
              <description>EFT Detect Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved10</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved11</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved12</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved13</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved14</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved15</name>
              <description>Reserved</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved16</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved17</name>
              <description>Reserved</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved18</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved19</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved20</name>
              <description>Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved21</name>
              <description>Reserved</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved22</name>
              <description>Reserved</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved23</name>
              <description>Reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved24</name>
              <description>Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved25</name>
              <description>Reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved26</name>
              <description>Reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved27</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved28</name>
              <description>Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved29</name>
              <description>Reserved</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved30</name>
              <description>Reserved</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved31</name>
              <description>Reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
