nxp-mcuxpresso/mcux-soc-svd/MCXW716C/MCXW716C.xml
        <register>
          <name>PCR6</name>
          <description>Pin Control 6</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Pull Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ps0</name>
                  <description>Enables internal pulldown resistor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ps1</name>
                  <description>Enables internal pullup resistor</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Pull Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pe0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pe1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PV</name>
              <description>Pull Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pv0</name>
                  <description>Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pv1</name>
                  <description>High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFE</name>
              <description>Passive Filter Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pfe0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pfe1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODE</name>
              <description>Open Drain Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ode0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ode1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX</name>
              <description>Pin Multiplex Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mux0</name>
                  <description>Pin disabled (analog)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux1</name>
                  <description>Alternative 1 (GPIO)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux10</name>
                  <description>Alternative 2 (chip-specific)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux11</name>
                  <description>Alternative 3 (chip-specific)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux100</name>
                  <description>Alternative 4 (chip-specific)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux101</name>
                  <description>Alternative 5 (chip-specific)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux110</name>
                  <description>Alternative 6 (chip-specific)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux111</name>
                  <description>Alternative 7 (chip-specific)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lk0</name>
                  <description>Locks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lk1</name>
                  <description>Does not lock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
