nxp-mcuxpresso/mcux-soc-svd/MCXW716C/MCXW716C.xml
        <register>
          <name>PHY_CTRL</name>
          <description>PHY CONTROL</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x807FF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XCVSEQ</name>
              <description>802.15.4 Transceiver Sequence Selector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XCVSEQ_0</name>
                  <description>I (IDLE)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCVSEQ_1</name>
                  <description>R (RECEIVE)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCVSEQ_2</name>
                  <description>T (TRANSMIT)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCVSEQ_3</name>
                  <description>C (CCA)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCVSEQ_4</name>
                  <description>TR (TRANSMIT/RECEIVE)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCVSEQ_5</name>
                  <description>CCCA (CONTINUOUS CCA)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOACK</name>
              <description>Auto Acknowledge Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTOACK_0</name>
                  <description>sequence manager will not follow a receive frame with a Tx Ack frame, under any conditions; the autosequence will terminate after the receive frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOACK_1</name>
                  <description>sequence manager will follow a receive frame with an automatic hardware-generated Tx Ack frame, assuming other necessary conditions are met.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXACKRQD</name>
              <description>Receive Acknowledge Frame required</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXACKRQD_0</name>
                  <description>An ordinary receive frame (any type of frame) follows the transmit frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACKRQD_1</name>
                  <description>A receive Ack frame is expected to follow the transmit frame (non-Ack frames are rejected).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCABFRTX</name>
              <description>CCA Before TX</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCABFRTX_0</name>
                  <description>no CCA required, transmit operation begins immediately.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCABFRTX_1</name>
                  <description>at least one CCA measurement is required prior to the transmit operation (see also SLOTTED).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLOTTED</name>
              <description>Slotted Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMRTRIGEN</name>
              <description>Timer2 Trigger Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMRTRIGEN_0</name>
                  <description>programmed sequence initiates immediately upon write to XCVSEQ.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMRTRIGEN_1</name>
                  <description>allow timer TC2 (or TC2') to initiate a preprogrammed sequence (see XCVSEQ register).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQMSK</name>
              <description>Sequencer Interrupt Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQMSK_0</name>
                  <description>allows completion of an autosequence to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQMSK_1</name>
                  <description>Completion of an autosequence will set the SEQIRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXMSK</name>
              <description>TX Interrupt Mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXMSK_0</name>
                  <description>allows completion of a TX operation to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXMSK_1</name>
                  <description>Completion of a TX operation will set the TXIRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXMSK</name>
              <description>RX Interrupt Mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXMSK_0</name>
                  <description>allows completion of a RX operation to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXMSK_1</name>
                  <description>Completion of a RX operation will set the RXIRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCAMSK</name>
              <description>CCA Interrupt Mask</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCAMSK_0</name>
                  <description>allows completion of a CCA operation to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCAMSK_1</name>
                  <description>Completion of a CCA operation will set the CCA status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_WMRK_MSK</name>
              <description>RX Watermark Interrupt Mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_WMRK_MSK_0</name>
                  <description>allows a Received Byte Count match to the RX_WTR_MARK threshold register to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_WMRK_MSK_1</name>
                  <description>A Received Byte Count match to the RX_WTR_MARK threshold register will set the RXWTRMRKIRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTERFAIL_MSK</name>
              <description>FilterFail Interrupt Mask</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTERFAIL_MSK_0</name>
                  <description>allows Packet Processor Filtering Failure to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTERFAIL_MSK_1</name>
                  <description>A Packet Processor Filtering Failure will set the FILTERFAIL_IRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_UNLOCK_MSK</name>
              <description>PLL Unlock Interrupt Mask</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_UNLOCK_MSK_0</name>
                  <description>allows PLL unlock event to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_UNLOCK_MSK_1</name>
                  <description>A PLL unlock event will set the PLL_UNLOCK_IRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_MSK</name>
              <description>CRC Mask</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_MSK_0</name>
                  <description>sequence manager ignores CRCVALID and considers the receive operation complete after the last octet of the frame has been received.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_MSK_1</name>
                  <description>sequence manager requires CRCVALID=1 at the end of the received frame in order for the receive operation to complete successfully; if CRCVALID=0, sequence manager will return to preamble-detect mode after the last octet of the frame has been received.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKE_MSK</name>
              <description>Mask wakeup from DSM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKE_MSK_0</name>
                  <description>Allows a wakeup from DSM to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKE_MSK_1</name>
                  <description>Wakeup from DSM will set the WAKE_IRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB_GRANT_DEASSERTION_MSK</name>
              <description>arb_grant Deassertion Interrupt Mask</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARB_GRANT_DEASSERTION_MSK_0</name>
                  <description>allows arb_grant deassertion event to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARB_GRANT_DEASSERTION_MSK_1</name>
                  <description>An arb_grant deassertion event will set the ARB_GRANT_DEASSERTION_IRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_MSK</name>
              <description>Mask generating interrupt from TSM</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSM_MSK_0</name>
                  <description>allows assertion of a TSM interrupt to generate a zigbee interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSM_MSK_1</name>
                  <description>Assertion of a TSM interrupt will set the TSM_IRQ status bit, but a zigbee interrupt is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR1CMP_EN</name>
              <description>Timer 1 Compare Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR1CMP_EN_0</name>
                  <description>Don't allow an Event Timer Match to T1CMP to set TMR1IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR1CMP_EN_1</name>
                  <description>Allow an Event Timer Match to T1CMP to set TMR1IRQ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR2CMP_EN</name>
              <description>Timer 2 Compare Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR2CMP_EN_0</name>
                  <description>Don't allow an Event Timer Match to T2CMP or T2PRIMECMP to set TMR2IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR2CMP_EN_1</name>
                  <description>Allow an Event Timer Match to T2CMP or T2PRIMECMP to set TMR2IRQ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR3CMP_EN</name>
              <description>Timer 3 Compare Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR3CMP_EN_0</name>
                  <description>Don't allow an Event Timer Match to T3CMP to set TMR3IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR3CMP_EN_1</name>
                  <description>Allow an Event Timer Match to T3CMP to set TMR3IRQ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR4CMP_EN</name>
              <description>Timer 4 Compare Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR4CMP_EN_0</name>
                  <description>Don't allow an Event Timer Match to T4CMP to set TMR4IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR4CMP_EN_1</name>
                  <description>Allow an Event Timer Match to T4CMP to set TMR4IRQ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC2PRIME_EN</name>
              <description>Timer 2 Prime Compare Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TC2PRIME_EN_0</name>
                  <description>Don't allow a match of the lower 16 bits of Event Timer to T2PRIMECMP to set TMR2IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC2PRIME_EN_1</name>
                  <description>Allow a match of the lower 16 bits of Event Timer to T2PRIMECMP to set TMR2IRQ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROMISCUOUS</name>
              <description>Promiscuous Mode Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROMISCUOUS_0</name>
                  <description>normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROMISCUOUS_1</name>
                  <description>all packet filtering except frame length checking (FrameLength&gt;=5 and FrameLength&lt;=127) is bypassed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC3_POSTPONE_ON_SFD</name>
              <description>Postpone TC3 Timeout On SFD Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TC3_POSTPONE_ON_SFD_0</name>
                  <description>TC3 Abort will occur on TMR3 timeout, regardless of rx_sfd_detect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC3_POSTPONE_ON_SFD_1</name>
                  <description>TC3 Abort will be deferred on TMR3 timeout if rx_sfd_detect is asserted; otherwise the TC3 Abort will occur immediately</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCATYPE</name>
              <description>Clear Channel Assessment Type</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCATYPE_0</name>
                  <description>ENERGY DETECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCATYPE_1</name>
                  <description>CCA MODE 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCATYPE_2</name>
                  <description>CCA MODE 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCATYPE_3</name>
                  <description>CCA MODE 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PANCORDNTR0</name>
              <description>Device is a PAN Coordinator on PAN0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TC3TMOUT</name>
              <description>TMR3 Timeout Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TC3TMOUT_0</name>
                  <description>TMR3 is a software timer only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC3TMOUT_1</name>
                  <description>Enable TMR3 to abort Rx or CCCA operations.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
