nxp-mcuxpresso/mcux-soc-svd/MCXW716C/MCXW716C.xml
        <register>
          <name>CPCR2</name>
          <description>Core Platform Control 2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCBC</name>
              <description>Clear Code Bus Cache</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ccbc0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ccbc1</name>
                  <description>Clear code bus cache</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCWB</name>
              <description>Disable Code Cache Write Buffer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dccwb0</name>
                  <description>Enable code cache write buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dccwb1</name>
                  <description>Disable code cache write buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCNA</name>
              <description>Force Code Cache to No Allocation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fccna0</name>
                  <description>Force code cache to allocation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fccna1</name>
                  <description>Force code cache to no allocation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCBC</name>
              <description>Disable Code Bus cache</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dcbc0</name>
                  <description>Enable code bus cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dcbc1</name>
                  <description>Disable code bus cache</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBCS</name>
              <description>Code Bus Cache Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cbcs0000</name>
                  <description>0 KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbcs0001</name>
                  <description>1 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbcs0010</name>
                  <description>2 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbcs0011</name>
                  <description>4 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbcs0100</name>
                  <description>8 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbcs0101</name>
                  <description>16 KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbcs0110</name>
                  <description>32 KB</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCCMCTRL</name>
              <description>Bypass Fixed Code Cache Map</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pccmctrl0</name>
                  <description>The fixed code cache map is not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pccmctrl1</name>
                  <description>The fixed code cache map is bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCCPWB</name>
              <description>Limit Code Cache Peripheral Write Buffering</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lccpwb0</name>
                  <description>Code cache peripheral write buffering is not limited: if write buffer is enabled, bufferable write is buffered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lccpwb1</name>
                  <description>Code cache peripheral write buffering is limited: only bufferable and cachable write is buffered.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LMDR2</name>
          <description>Local Memory Descriptor 2</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x84844000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCPME</name>
              <description>PC Parity Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pcpme0</name>
                  <description>PC parity is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcpme1</name>
                  <description>PC parity is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCPFE</name>
              <description>PC Parity Fault Report Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pcpfe0</name>
                  <description>PC parity fault report is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcpfe1</name>
                  <description>PC parity fault report is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MT</name>
              <description>Memory Type</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mt000</name>
                  <description>SRAM_L</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mt001</name>
                  <description>SRAM_U</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mt010</name>
                  <description>PC Cache</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mt011</name>
                  <description>PS Cache</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>Read-Only</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ro0</name>
                  <description>Writes to the corresponding LMDRn[7:0] are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ro1</name>
                  <description>Writes to the corresponding LMDRn[7:0] are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPW</name>
              <description>LMEM Data Path Width</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dpw010</name>
                  <description>LMEMn 32-bit wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dpw011</name>
                  <description>LMEMn 64-bit wide</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WY</name>
              <description>Level 1 Cache Ways</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wy0000</name>
                  <description>No Cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wy0010</name>
                  <description>2-Way Set Associative</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wy0100</name>
                  <description>4-Way Set Associative</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wy1000</name>
                  <description>8-Way Set Associative</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZ</name>
              <description>LMEM Size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lmsz0000</name>
                  <description>no LMEMn (0 KB)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz0001</name>
                  <description>1 KB LMEMn</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz0010</name>
                  <description>2 KB LMEMn</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz0011</name>
                  <description>4 KB LMEMn</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz0100</name>
                  <description>8 KB LMEMn</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz0101</name>
                  <description>16 KB LMEMn</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz0110</name>
                  <description>32 KB LMEMn</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz0111</name>
                  <description>64 KB LMEMn</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz1000</name>
                  <description>128 KB LMEMn</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz1001</name>
                  <description>256 KB LMEMn</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz1010</name>
                  <description>512 KB LMEMn</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz1011</name>
                  <description>1024 KB LMEMn</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz1100</name>
                  <description>2048 KB LMEMn</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz1101</name>
                  <description>4096 KB LMEMn</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz1110</name>
                  <description>8192 KB LMEMn</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmsz1111</name>
                  <description>16384 KB LMEMn</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZH</name>
              <description>LMEM Size Hole</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lmszh0</name>
                  <description>LMEMn is a power-of-2 capacity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lmszh1</name>
                  <description>LMEMn is a capacity of 0.75 * LMSZ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>LMEMn is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>LMEMn is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LMPECR</name>
          <description>LMEM Parity Control</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ECPR</name>
              <description>Enable Cache Parity Reporting</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ecpr0</name>
                  <description>Cache parity reporting is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ecpr1</name>
                  <description>Cache parity reporting is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LMPEIR</name>
          <description>LMEM Parity Interrupt</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PE</name>
              <description>Parity Error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PEELOC</name>
              <description>Error Location</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>V</name>
              <description>Valid bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMFAR</name>
          <description>LMEM Fault Address</description>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EFADD</name>
              <description>Fault Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
